/**
 * GiftIcon.js - 포션 선물 아이콘 컴포넌트
 * 
 * 포션 병 모양의 선물 아이콘
 */

import React from 'react';

const GiftIcon = ({ width = 24, height = 24, color = "#222" }) => {
  return (
    <svg 
      width={width} 
      height={height} 
      viewBox="0 0 19 19" 
      fill="none" 
      xmlns="http://www.w3.org/2000/svg"
    >
      <g clipPath="url(#clip0_875_962)">
        <path 
          d="M15.833 9.5026V17.4193H3.16634V9.5026M9.49967 17.4193V5.54427M9.49967 5.54427H5.93717C5.41227 5.54427 4.90886 5.33575 4.53769 4.96459C4.16653 4.59342 3.95801 4.09001 3.95801 3.5651C3.95801 3.0402 4.16653 2.53679 4.53769 2.16562C4.90886 1.79446 5.41227 1.58594 5.93717 1.58594C8.70801 1.58594 9.49967 5.54427 9.49967 5.54427ZM9.49967 5.54427H13.0622C13.5871 5.54427 14.0905 5.33575 14.4617 4.96459C14.8328 4.59342 15.0413 4.09001 15.0413 3.5651C15.0413 3.0402 14.8328 2.53679 14.4617 2.16562C14.0905 1.79446 13.5871 1.58594 13.0622 1.58594C10.2913 1.58594 9.49967 5.54427 9.49967 5.54427ZM1.58301 5.54427H17.4163V9.5026H1.58301V5.54427Z" 
          stroke={color} 
          strokeWidth="1.6" 
          strokeLinecap="round" 
          strokeLinejoin="round"
        />
      </g>
      <defs>
        <clipPath id="clip0_875_962">
          <rect width="19" height="19" fill="white"/>
        </clipPath>
      </defs>
    </svg>
  );
};

export default GiftIcon;

